#  More examples of Group by & Apply

In [50]:
import pandas as pd

In [51]:
# Occupation dataset
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",header=0,sep='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [53]:
# Statistical summary 
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [54]:
# What is the ratio of male and female?

df.gender.value_counts()
# type(df.gender.value_counts())

gender
M    670
F    273
Name: count, dtype: int64

In [55]:
m_to_f = df.gender.value_counts()
type(m_to_f)

m_to_f

gender
M    670
F    273
Name: count, dtype: int64

In [56]:
ratio=m_to_f[0]/m_to_f[1] #670/273
ratio

2.4542124542124544

In [57]:
round(df.gender.value_counts()[0]/df.gender.value_counts()[1],3)

2.454

In [58]:
round(df.gender.value_counts()[0]/df.gender.value_counts()[1],3) #second value is for how many digits to round to

2.454

In [59]:
a = m_to_f[0]
b = m_to_f[1]

ratio = a/b
print(ratio)

2.4542124542124544

In [60]:
m_to_f[0]/m_to_f[1]

2.4542124542124544

In [61]:
df.gender.value_counts()[0]/df.gender.value_counts()[1]

2.4542124542124544

In [62]:
# Sort the mean age of persons by occupation in ascending order, which occupation is the youngest?

In [63]:
df.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [64]:
df.groupby('occupation').age.mean().sort_values(ascending=True)

occupation
student          22.081633
none             26.555556
entertainment    29.222222
artist           31.392857
homemaker        32.571429
programmer       33.121212
technician       33.148148
other            34.523810
scientist        35.548387
salesman         35.666667
writer           36.311111
engineer         36.388060
lawyer           36.750000
marketing        37.615385
executive        38.718750
administrator    38.746835
librarian        40.000000
healthcare       41.562500
educator         42.010526
doctor           43.571429
retired          63.071429
Name: age, dtype: float64

In [65]:
# what is the male to female ratio for each occupation?

df['male'] = df.gender.apply(lambda x: 1 if x == 'M' else 0) 
df['female'] = df.gender.apply(lambda x: 1 if x == 'F' else 0) 

df['male'] = df.male.astype(int)
df['female'] = df.female.astype(int)

df.head(5)

   user_id  age gender  occupation zip_code  male  female
0        1   24      M  technician    85711     1       0
1        2   53      F       other    94043     0       1
2        3   23      M      writer    32067     1       0
3        4   24      M  technician    43537     1       0
4        5   33      F       other    15213     0       1

In [19]:
# what is the maximun and minimum age for each occupation?

df.groupby('occupation').age.agg(['min', 'max','median','mean'])

               min  max  median       mean
occupation
administrator   21   70    37.0  38.746835
artist          19   48    30.0  31.392857
doctor          28   64    45.0  43.571429
educator        23   63    42.0  42.010526
engineer        22   70    36.0  36.388060
entertainment   15   50    25.0  29.222222
executive       22   69    38.5  38.718750
healthcare      22   62    44.5  41.562500
homemaker       20   50    32.0  32.571429
lawyer          21   53    34.0  36.750000
librarian       23   69    39.0  40.000000
marketing       24   55    36.0  37.615385
none            11   55    26.0  26.555556
other           13   64    32.0  34.523810
programmer      20   63    30.0  33.121212
retired         51   73    63.0  63.071429
salesman        18   66    34.0  35.666667
scientist       23   55    37.0  35.548387
student          7   42    21.0  22.081633
technician      21   55    30.0  33.148148
writer          18   60    36.0  36.311111

# US crime dataset

In [35]:
import pandas as pd


# Read the CSV file into a pandas DataFrame
df = pd.read_csv(r'C:\Users\USER\Downloads\Copy of US_Crime_Rates_1960_2014.csv')

# Display the first 5 rows of the DataFrame
print(df.head(5))

   Year  Population    Total  Violent  Property  Murder  Forcible_Rape  \
0  1960   179323175  3384200   288460   3095700    9110          17190
1  1961   182992000  3488000   289390   3198600    8740          17220
2  1962   185771000  3752200   301510   3450700    8530          17550
3  1963   188483000  4109500   316970   3792500    8640          17650
4  1964   191141000  4564600   364220   4200400    9360          21420

   Robbery  Aggravated_assault  Burglary  Larceny_Theft  Vehicle_Theft
0   107840              154320    912100        1855400         328200
1   106670              156760    949600        1913000         336000
2   110860              164570    994300        2089600         366800
3   116470              174210   1086400        2297800         408300
4   130390              203050   1213200        2514400         472800

In [36]:
# What is the type of the columns?
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     int64
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: int64(12)
memory usage: 5.3 KB

In [28]:
df.head(3)

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800

In [37]:
# Have you noticed that the type of Year is int64.
# But pandas has a different type to work with Time Series.

# Convert the type of the column Year to datetime64

df['Year'] = pd.to_datetime(df.Year, format = "%Y") #yyyy-mm-dd
df.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960-01-01,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961-01-01,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962-01-01,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963-01-01,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964-01-01,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     datetime64[ns]
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: datetime64[ns](1), int64(11)
memory usage: 5.3 KB

In [39]:
# Set the Year column as the index of the dataframe

In [40]:
df = df.set_index('Year')
df.head(5)

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,,
1960-01-01,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [41]:
# Delete the Total column

In [42]:
df.drop('Total', axis = 1, inplace = True) #axis is for rows and cols. (0-rows, 1-columns). 
#inplace=True is to make sure that the action occurs directly in the dataset.
df.head(5)

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-01-01,179323175,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [43]:
df.drop('Total', axis = 1,inplace=False).head()

KeyError: "['Total'] not found in axis"

In [44]:
df.head()

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-01-01,179323175,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [45]:
#1910, 1911, 1912, ... , 1919 ---> 1910
#1920,.....,1929 --> 1920


#(1915//10)*10

for i in range(1910,1920):
    print(i,((i // 10)*10))

1910 1910
1911 1910
1912 1910
1913 1910
1914 1910
1915 1910
1916 1910
1917 1910
1918 1910
1919 1910

In [46]:
# Group the year by decades and sum the values
df.groupby(df.index.year // 10 * 10).sum().sort_values(by=['Violent'], ascending=False)

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1990,2612825258,17527048,119053499,211664,998827,5748930,10568963,26750015,77679366,14624418
1980,2371370069,14074328,117048900,206439,865639,5383109,7619130,33073494,72040253,11935411
2000,2947969117,13968056,100944369,163068,922499,4230366,8652124,21565176,67970291,11412834
1970,2121193298,9607930,91383800,192230,554570,4159020,4702120,28486000,53157800,9739900
2010,1570146307,6072017,44095950,72867,421059,1749809,3764142,10125170,30401698,3569080
1960,1915053175,4134930,45160900,106180,236720,1633510,2158520,13321100,26547700,5292100

In [47]:
# What was the most dangerous decade to live in the US?